In [4]:
import numpy as np
import pandas as pd

In [13]:
cases_by_country = pd.read_csv('confirmed_cases_by_country.csv',usecols=[0,2,3],parse_dates=['date'])
cases_by_country.head()
print(cases_by_country.head())

               country       date  cases
0          Afghanistan 2020-01-22      0
1              Albania 2020-01-22      0
2              Algeria 2020-01-22      0
3              Andorra 2020-01-22      0
4  Antigua and Barbuda 2020-01-22      0

In [14]:
cases_by_country.dtypes

country            object
date       datetime64[ns]
cases               int64
dtype: object

In [15]:
pd.read_table('joyful-pandas/data/my_table_special_sep.txt')

              col1 |||| col2
0  TS |||| This is an apple.
1    GQ |||| My name is Bob.
2         WT |||| Well done!
3    PT |||| May I help you?

In [17]:
pd.read_table('joyful-pandas/data/my_table_special_sep.txt',sep=' \|\|\|\| ', engine='python')

  col1               col2
0   TS  This is an apple.
1   GQ    My name is Bob.
2   WT         Well done!
3   PT    May I help you?

In [18]:
s = pd.Series(data= [100,'a',{'dict':5}],index = pd.Index(['id1',20,'third'],name='my_idx'),
                     dtype = 'object',
                     name = 'my_name')

In [19]:
s

my_idx
id1              100
20                 a
third    {'dict': 5}
Name: my_name, dtype: object

In [23]:
df = pd.read_csv('joyful-pandas/data/learn_pandas.csv')
df.columns

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer',
       'Test_Number', 'Test_Date', 'Time_Record'],
      dtype='object')

In [24]:
df = df[df.columns[:7]]

In [25]:
df_demo = df[['Height', 'Weight']]

In [26]:
df_demo.quantile(0.75)

Height    167.5
Weight     65.0
Name: 0.75, dtype: float64

In [27]:
df_demo.count()

Height    183
Weight    189
dtype: int64

In [28]:
df_demo.idxmax()

Height    193
Weight      2
dtype: int64

In [29]:
df['School'].unique()

array(['Shanghai Jiao Tong University', 'Peking University',
       'Fudan University', 'Tsinghua University'], dtype=object)

In [30]:
df['School'].value_counts()

Tsinghua University              69
Shanghai Jiao Tong University    57
Fudan University                 40
Peking University                34
Name: School, dtype: int64

In [31]:
df['Gender'].replace({'Female':0,'Male':1}).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

In [32]:
df['Gender'].replace(['Female', 'Male'], [0, 1]).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

In [33]:
s = pd.Series([1,2,3,4,5])

roller = s.rolling(window = 3)
roller

Rolling [window=3,center=False,axis=0]

In [34]:
roller.sum()

0     NaN
1     NaN
2     6.0
3     9.0
4    12.0
dtype: float64

In [71]:
s = pd.Series([1,3,6,10,15])
s.shift(2)

0   -5.0
1   -7.0
2   -9.0
3    NaN
4    NaN
dtype: float64

In [72]:
s.diff(3)

0     NaN
1     NaN
2     NaN
3     9.0
4    12.0
dtype: float64

In [74]:
s.pct_change()

0         NaN
1    2.000000
2    1.000000
3    0.666667
4    0.500000
dtype: float64

In [75]:
s.shift(-1)

0     3.0
1     6.0
2    10.0
3    15.0
4     NaN
dtype: float64

In [77]:
s.diff(-2)

0   -5.0
1   -7.0
2   -9.0
3    NaN
4    NaN
dtype: float64

In [78]:
s = pd.Series([1,3,6,10])
s.expanding().mean()

0    1.000000
1    2.000000
2    3.333333
3    5.000000
dtype: float64

In [37]:
pokemon_csv = pd.read_csv('joyful-pandas/data/pokemon.csv')

In [58]:
# 加总，验证是否为Total值
pokemon_csv['sum'] = pokemon_csv[['HP', 'Attack', 'Defense', 'Sp. Atk', 'Sp. Def', 'Speed']].sum(1)
pokemon_csv['cheak'] = pokemon_csv[['Total','sum']].apply(lambda x:x['Total'] == x['sum'],axis=1)

# 答案
(df[['HP', 'Attack', 'Defense', 'Sp. Atk', 'Sp. Def', 'Speed']].sum(1)!=df['Total']).mean()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,sum,cheak
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,318,True
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,405,True
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,525,True
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,625,True
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,309,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,600,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,700,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,600,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,680,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,600,True

In [66]:
# #重复的妖怪只保留第一条记录，解决以下问题：
unique_pokemon = pokemon_csv.drop_duplicates('#')

In [42]:
# 求第一属性的种类数量
unique_pokemon['Type 1'].nunique()

18

In [44]:
# 求第一属性前三多数量对应的种类
unique_pokemon['Type 1'].value_counts().head(3)

Water     105
Normal     93
Grass      66
Name: Type 1, dtype: int64

In [46]:
# 求第一属性和第二属性的组合种类
com_type = unique_pokemon.drop_duplicates(['Type 1', 'Type 2'])
com_type.shape[0]

143

In [59]:
# 求尚未出现过的属性组合
# 啊 这个也不会做
L_full = [' '.join([i, j]) if i!=j else i for j in unique_pokemon['Type 1'].unique() for i in unique_pokemon['Type 1'].unique()]
L_part = [' '.join([i, j]) if type(j)!=float else i for i, j in zip(unique_pokemon['Type 1'], unique_pokemon['Type 2'])]
res = set(L_full).difference(set(L_part))

In [68]:
# 取出物攻，超过120的替换为 high ，不足50的替换为 low ，否则设为 mid
# unique_pokemon['Attack'].mask(unique_pokemon['Attack']>120, 'high').mask(unique_pokemon['Attack']<50, 'low').mask((50<=unique_pokemon['Attack'])&(unique_pokemon['Attack']<=120), 'mid')

In [65]:
# 取出第一属性，分别用 replace 和 apply 替换所有字母为大写
unique_pokemon['Type 1'].replace({i:str.upper(i) for i in unique_pokemon['Type 1'].unique()})
unique_pokemon['Type 1'].apply(lambda x:str.upper(x)).head()

0    GRASS
1    GRASS
2    GRASS
4     FIRE
5     FIRE
Name: Type 1, dtype: object

In [ ]:
# 求每个妖怪六项能力的离差，即所有能力中偏离中位数最大的值，添加到 df 并从大到小排序
unique_pokemon['Deviation'] = unique_pokemon[['HP', 'Attack', 'Defense', 'Sp. Atk', 'Sp. Def', 'Speed']].apply(lambda x:np.max((x-x.median()).abs()), 1)
unique_pokemon.sort_values('Deviation', ascending=False).head()